app/controllers/boards_controller.rb

  def index
    @boards = Board.page(params[:page])
---
SELECT  `boards`.* FROM `boards` LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `boards`

  def create
    board = Board.new(board_params)
    if board.save
---
INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('tanaka', 'こんにちは', 'とてもいい天気ですね', '2022-05-03 08:31:00', '2022-05-03 08:31:00')

  def update
    @board.update(board_params)
---
UPDATE `boards` SET `name` = 'tanaka編集', `title` = 'こんにちは編集', `body` = '編集とてもいい天気ですね', `updated_at` = '2022-05-03 10:13:36' WHERE `boards`.`id` = 1

  def destroy
    @board.delete
---
DELETE FROM `boards` WHERE `boards`.`id` = 4

  def set_target_board
    @board = Board.find(params[:id])
---
SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 4 LIMIT 1